app/controllers/businesses_controller.rb

  def index
    @businesses = Business.verified.all
---
SELECT * FROM `businesses`

  def show
    @business = Business.find(params[:id])
---
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 1)

  def edit
    @business = Business.find(params[:id])
---
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 1)

  def create
    @business = Business.new(params[:business])

    if @business.save
---
INSERT INTO `businesses` (`key_contact`, `mobile_telephone`, `address_city`, `comment`, `created_at`, `office_telephone`, `updated_at`, `organization_name`, `address_zipcode`, `email_address`, `address_state`, `state_date`, `address_line1`, `address_line2`) VALUES('Me', '234234234', 'san fran', 'adsfasdfasdf', '2009-11-22 22:30:41', '234234234', '2009-11-22 22:30:41', 'Vender', '94707', 'sthorpe@gmail.com', 'cal', '2009-11-22', '2342', '234')

  def update
    @business = Business.find(params[:id])
    if @business.update_attributes(params[:business])
---
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 1)
UPDATE `businesses` SET `updated_at` = '2009-11-22 00:21:51', `name` = 'Clocktower Coffee' WHERE `id` = 1