app/controllers/offers_controller.rb

SELECT * FROM `offers`
---
  def index
    @offers = Offer.all

SELECT * FROM `offers`
---
  def show
    @offers = Offer.all

SELECT * FROM `offers` WHERE (`offers`.`id` = 1)
---
  def edit
    @offer = Offer.find(params[:id])

INSERT INTO `offers` (`name`, `offer_expiration`, `free_y_n`, `created_at`, `updated_at`, `offer_terms`, `organization_id`, `item`, `percent_off`) VALUES('Peter is Cool', '2009-11-22', 0, '2009-11-22 20:31:01', '2009-11-22 20:31:01', 'He has to code in ruby', NULL, 'Baseball cap', 10)
---
  def create
    @offer = Offer.new(params[:offer])

    respond_to do |format|
      if @offer.save