app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `foursquare_request_token_secret`, `updated_at`, `deleted_at`, `activation_code`, `foursquare_request_token_key`, `remember_token`, `company_id`, `login`, `email`, `state`) VALUES('', '916c643427069778dc2be17573eadf548e902718', '2009-11-22 22:47:03', NULL, '06a19a2f4ff68bb8997f112509439ae797638671', NULL, NULL, '2009-11-22 22:47:03', NULL, 'd47919638c93ba94c236a83c9682e9e79839c0f5', NULL, NULL, NULL, NULL, 'me@me.com', 'pending')
INSERT INTO `businesses` (`key_contact`, `mobile_telephone`, `address_city`, `start_date`, `comment`, `created_at`, `office_telephone`, `updated_at`, `organization_name`, `address_zipcode`, `email_address`, `address_state`, `address_line1`, `address_line2`) VALUES(NULL, NULL, NULL, NULL, NULL, '2009-11-23 00:07:34', NULL, '2009-11-23 00:07:34', 'lskdfj@laksdjf.com', NULL, NULL, NULL, NULL, NULL)
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    @user.register! if @user
    success = @user && @user.save
    if success && @user.errors.empty?
      @user.activate!
      @business = Business.new(:organization_name => params[:company_name])
      @business.save!

SELECT * FROM `offers`
---
  def show
    @offers = Offer.all